artillery/progressive-all.yml
config:
  target: "http://localhost"
  processor: "./post-body.js"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 15
      name: Ramp up load
    - duration: 90
      arrivalRate: 15
      name: Sustained load
  environments:
    prod:
      target: "http://localhost"
      phases:
        - duration: 120
          arrivalRate: 10
    stage:
      target: "http://localhost:3000"
      phases:
        - duration: 120
          arrivalRate: 10
scenarios:
  - name: "Bids, Buyers & Offers"
    flow:
    - function: "genPayloads"
    - post:
        url: "/bids/buyers"
        json:
          "{{ buyerPayload1 }}"
        capture:
          json: "$.buyer.ip"
          as: "buyerIp2"
        expect:
          - statusCode: 201
    - post:
        url: "/bids/buyers"
        json:
          "{{ buyerPayload2 }}"
        capture:
          json: "$.buyer.ip"
          as: "buyerIp1"
        expect:
          - statusCode: 201
    - post:
        url: "/bids/bids"
        json:
          "{{ bidPayload }}"
        capture:
          json: "$.bid.id"
          as: "bidId"
        expect:
          - statusCode: 201
    - put:
        url: "/bids/bids/{{ bidId }}"
        json:
          ip: "{{ buyerIp1 }}"
          price: "{{ 1000 }}"
        expect:
          - statusCode: 200
    - put:
        url: "/bids/bids/{{ bidId }}"
        json:
          ip: "{{ buyerIp2 }}"
          price: "{{ 2000 }}"
        expect:
          - statusCode: 200
  - name: "GET /health"
    flow:
    - get:
        url: "/health"