artillery/progressive.yml
config:
  target: "http://localhost"
  processor: "./post-body.js"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  environments:
    prod:
      target: "http://localhost"
      phases:
        - duration: 120
          arrivalRate: 10
    stage:
      target: "http://localhost:3000"
      phases:
        - duration: 120
          arrivalRate: 10
scenarios:
  - name: "POST /bids/buyers"
    flow:
    - function: "genBuyerPayload"
    - post:
        url: "/bids/buyers"
        json:
          "{{ buyerPayload }}"
        expect:
          - statusCode: 201
  - name: "POST /bids/bids"
    flow:
    - function: "genBidPayload"
    - post:
        url: "/bids/bids"
        json:
          "{{ bidPayload }}"
        expect:
          - statusCode: 201
  - name: "GET /health"
    flow:
    - get:
        url: "/health"